usernameTokenNonce.jar/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="1"
                       xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken
                    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                    wsu:Id="UsernameToken-2de503b0-d31e-4b90-8821-16779d19fb91">
                <wsse:Username>Viral</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    RedHat13#
                </wsse:Password>
               <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    uCNl3UOvL6+Y9t+gD4RXIQ==
                </wsse:Nonce>
                <wsu:Created>2016-12-21T09:40:06.276Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns2:sayHello xmlns:ns2="http://wss.gss.redhat.com/">
            <arg0>Viral</arg0>
        </ns2:sayHello>
    </soap:Body>
</soap:Envelope>

